Revit 2027 API
XYZ.IsUnitLength Method
The boolean value that indicates whether this vector is of unit length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsUnitLength()
Public Function IsUnitLength As Boolean
public:
bool IsUnitLength()
member IsUnitLength : unit -> bool
Return Value
Boolean
Remarks
 A unit length vector has a length of one, and is considered normalized.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace